Номер 1

In [ ]:
import numpy as np
import pandas as pd

r = np.random.RandomState(1)
s = pd.Series(r.uniform(0, 10, 100))
s[s > 5]

1     7.203245
9     5.388167
11    6.852195
13    8.781174
15    6.704675
17    5.586898
20    8.007446
21    9.682616
23    6.923226
24    8.763892
25    8.946067
29    8.781425
32    9.578895
33    5.331653
34    6.918771
36    6.865009
37    8.346257
39    7.501443
40    9.888611
41    7.481657
43    7.892793
46    9.085955
51    6.788355
56    5.741176
58    5.893055
59    6.997584
62    6.944002
65    5.358964
66    6.637946
67    5.148891
68    9.445948
69    5.865550
70    9.034019
73    8.073913
76    9.275086
78    7.508121
79    7.259980
80    8.833061
81    6.236722
82    7.509424
85    8.958862
87    9.648400
88    6.634415
89    6.216957
91    9.494893
93    5.783896
96    9.033795
97    5.736795
99    6.171449
dtype: float64

Номер 2

In [ ]:
df = pd.DataFrame({
    'имя': ['Петя', 'Вася', 'Аня', 'Света'],
    'возраст': [45, 26, 41 , 21],
    'доход': [100000, 80000, 150000, 60000],
    'надежность клиента (0..1)': [0.65, 0.74, 0.87, 0.68],
    'пол': ['муж', 'муж', 'жен', 'жен']},
    index=[0, 1, 2, 3])
age_above_40 = df['возраст'] > 40
print(df[age_above_40])
print("_"*60)

dohod = df['доход'] > df['доход'].mean()
print(df[dohod])
print("_"*60)

dohod_nad = df['надежность клиента (0..1)'] < df['надежность клиента (0..1)'].mean()
print(df[dohod & dohod_nad])     
print("_"*60)

df['Важность клиента'] = df['доход'] * df['надежность клиента (0..1)']

df['возможная долгосрочность клиента'] = (df['Важность клиента'] * 
                                         (df['возраст'].mean() - df['возраст']))


df

    имя  возраст   доход  надежность клиента (0..1)  пол
0  Петя       45  100000                       0.65  муж
2   Аня       41  150000                       0.87  жен
____________________________________________________________
    имя  возраст   доход  надежность клиента (0..1)  пол
0  Петя       45  100000                       0.65  муж
2   Аня       41  150000                       0.87  жен
____________________________________________________________
    имя  возраст   доход  надежность клиента (0..1)  пол
0  Петя       45  100000                       0.65  муж
____________________________________________________________

     имя  возраст  ...  Важность клиента  возможная долгосрочность клиента
0   Петя       45  ...           65000.0                         -763750.0
1   Вася       26  ...           59200.0                          429200.0
2    Аня       41  ...          130500.0                        -1011375.0
3  Света       21  ...           40800.0                          499800.0

[4 rows x 7 columns]

Номер 3

In [ ]:
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['low', 'medium', 'high'] * 3,
                    'price': np.random.randint(0, 100, 9)})

df2 = pd.DataFrame({'frukt': ['apple', 'banana', 'melon'] * 2,
                    'ves': ['low', 'high'] * 3,
                    'price': np.random.randint(0, 100, 6)})

pd.merge(df1, df2, how='inner', left_on=['fruit', 'weight'], right_on=['frukt', 'ves'])

   fruit weight  price_x  frukt  ves  price_y
0  apple    low       77  apple  low       82
1  apple    low       66  apple  low       82
2  apple    low        8  apple  low       82

Номер 4

In [ ]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'name': ['Иван', 'Анна', 'Мария', 'Василий', 'Анастасия'],
    'math': [5, 3, 3, 4, 4],
    'russian': [4, 4, 4, 5, 3],
    'history': [5, 4, 3, 4, 5]})

df['mean'] = (df['math'] + df['russian'] + df['history']) / 3
df['class'] = ['11A', '11A', '11Б', '11Г', '11Б']

df1 = df.drop(1)

df.iloc[[0, 3],0:4]

      name  math  russian  history
0     Иван     5        4        5
3  Василий     4        5        4